Revit 2027 API
Space.PowerLoadUnit Property
Get or set the Power Load Unit of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BaseLoadOn PowerLoadUnit { get; set; }
Public Property PowerLoadUnit As BaseLoadOn
	Get
	Set
public:
property BaseLoadOn PowerLoadUnit {
	BaseLoadOn get ();
	void set (BaseLoadOn value);
}
member PowerLoadUnit : BaseLoadOn with get, set
Property Value
BaseLoadOn
Remarks
This property is used to get or set the Power Load Unit of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace